Revit 2024 API
BaseExportOptions.SetExportPatternTable Method
 Sets the pattern table to use during export.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public void SetExportPatternTable(
	ExportPatternTable patternTable
)
Visual Basic
Public Sub SetExportPatternTable ( _
	patternTable As ExportPatternTable _
)
Visual C++
public:
void SetExportPatternTable(
	ExportPatternTable^ patternTable
)
Parameters
patternTable
Type: Autodesk.Revit.DB.ExportPatternTable
 The pattern table to be set.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
BaseExportOptions Class
Autodesk.Revit.DB Namespace